Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: There was another guy with him.
hi: उसके साथ और एक बंदा था।

source: There was another guy with her.
hi: उसके साथ और एक बंदा था।

source: I don't completely trust him.
hi: मेरा उस पर पूरा विश्वास नहीं है।

source: Give this to him.
hi: यह उसे दे दो।

source: Give this to her.
hi: यह उसे दे दो।

source: Tom just wants to talk to them.
hi: टॉम बस उनसे बात करना चाहता है।

source: I'm going to speak to them.
hi: मैं उनसे बात करने वाला हूँ।

source: Nothing will happen to him.
hi: उसे कुछ नहीं होगा।

source: I'll tell them the truth.
hi: मैं उन्हें सच बता दूंगा।

source: Take him outside.
hi: उसे बाहर ले जाओ।

source: It isn't her.
hi: वह नहीं है।

source: They shot him.
hi: उन्होंने उसे गोली मारी।

source: I saw them today.
hi: मैंने उन्हें आज देखा।

source: Save us.
hi: हमें बचाइए।

source: Who says I'm afraid of him?
hi: कौन कहता है मैं उससे डरता हूँ?

source: I've met him.
hi: मैं उससे मिला हूँ।

source: We want to meet him.
hi: हम उससे मिलना चाहते हैं।

source: I made her laugh.
hi: मैंने उसे हसाया।

source: Did you love her?
hi: क्या तुम उससे प्यार करते थे?

source: Why did you let us go?
hi: तुमने हमें जाने क्यों दिया?

source: Why did you let them go?
hi: तुमने उन्हें जाने क्यों दिया?

source: Why did you let me go?
hi: तुमने मुझे जाने क्यों दिया?

source: Why did you let him go?
hi: तुमने उसे जाने क्यों दिया?

source: Why did you let her go?
hi: तुमने उसे जाने क्यों दिया?

source: Leave her.
hi: छोड़ दो उसे.

source: I didn't know him very well.
hi: मैं उसे अच्छी तरह से नहीं जानता।

source: Can you help him?
hi: क्या तुम उसकी मदद कर सकते हो?

source: Why doesn't anybody help me?
hi: कोई मेरी मदद क्यों नहीं करता?

source: I don't work for her.
hi: मैं उसके लिये काम नहीं करता।

source: We followed them.
hi: हमने उनका पीछा किया।

source: Someone called her.
hi: उसे किसी ने बुलाया।

source: Are you going to ask her?
hi: क्या तुम उसे पूछने वाले हो?

source: Let's go and ask him.
hi: जा कर उसे पूछते हैं।

source: We were talking about him.
hi: हम उसके बारे में बोल रहे थे।

source: We're talking about him.
hi: हम उसके बारे में बात कर रहे हैं।

source: Don't talk about us.
hi: हमारे बारे में बात मत कीजिए।

source: I learned a lot about them.
hi: मैं उनके बारे में बहुत कुछ सीखा।

source: I haven't found Tom yet.
hi: मुझे अभी तक टॉम मिला नहीं है।

source: Why were you helping Tom?
hi: तुम टॉम की मदद क्यों कर रहे थे?

source: Tom works in a bank.
hi: टॉम एक बैंक में काम करता है।

source: Tom works at a bank.
hi: टॉम एक बैंक में काम करता है।

source: Tom made tea for me.
hi: टॉम ने मेरे लिये चाय बनाई।

source: They opened the door.
hi: उन्होंने दरवाज़ा खोला।

source: Greece is an old country.
hi: यूनान एक पुराना देश है।

source: Carlos Slim is the world's second richest person.
hi: कार्लोस स्लिम दुनिया के दूसरे सबसे अमीर व्यक्ति हैं।

source: Should I prepare the coffee?
hi: क्या मैं काॅफी बना दूं?

source: Spanish is spoken in many countries.
hi: स्पेनी कई देशों में बोली जाती है।

source: Sit and have some tea!
hi: बैठो, थोड़ी चाय लो!

source: The dog is black.
hi: कुत्ता काला है।

source: Why is space black?
hi: अंतरिक्ष काला क्यों होता है?

source: My name is Tom. How can I help you?
hi: मेरा नाम टॉम है। मैं आपकी क्या मदद कर सकता हूँ?

source: Do you love your mother?
hi: क्या आप अपनी माँ से प्यार करते हैं?

source: I speak the Persian language.
hi: मैं फ़ारसी भाषा बोलता हूँ।

source: Dan and Linda began to have sex.
hi: डॅन और लिंडा सेक्स करने लगे।

source: My name is Jim.
hi: मेरा नाम जिम है।

source: How was the bachelor party?
hi: बैचलर पार्टी कैसी रही?

source: What are you doing here now?
hi: अब तुम यहाँ क्या कर रहे हो?

source: Have you ever had a girlfriend?
hi: क्या तुम्हारी कभी कोई गर्लफ़्रेंड रही है?

source: Why did Tom send Mary flowers?
hi: टॉम ने मैरी को फूल क्यों भेजें?

source: I want to write a poem.
hi: मैं एक कविता लिखना चाहता हूँ।

source: He bought some rice.
hi: उसने थोड़ा सा चावल खरीदा।

source: The house is red.
hi: घर लाल है।

source: That was just a trailer, the film is yet to come.
hi: यह तो बस एक ट्रेलर था, फ़िल्म अभी बाकी है।

source: That was just the trailer, the movie's yet to come, my friend!
hi: यह तो बस ट्रेलर है, पिक्चर अभी बाकी है, मेरे दोस्त!

source: I will learn Esperanto.
hi: मैं एस्पेरांतो सीखूंगा।

source: The escalator suddenly stopped.
hi: एस्केलेटर अचानक थम गया।

source: When will human greed end?
hi: इनसान की लालच कब ख़त्म होगी?

source: I drink water.
hi: मैं पानी पीता हूँ।

source: You are acting like a three-year-old child.
hi: तुम किसी तीन साल के बच्चे की तरह बर्ताव कर रहे हो।

source: My name's Ricardo.
hi: मेरा नाम रिकार्डो है।

source: He always drinks black coffee.
hi: वह हमेशा काली काफ़ी पीता है।

source: Black paper absorbs light.
hi: काला कागज प्रकाश सोखता है।

source: No one can stop me now.
hi: अब मुझे कोई भी रोक नहीं सकता।

source: How was the food?
hi: खाना कैसा था?

source: I live in New Delhi.
hi: मैं नई दिल्ली में रहता हूँ।

source: I want to live in India.
hi: मैं भारत में रहना चाहता हूँ।

source: What do they call him?
hi: इसको क्या कहते हैं?

source: What do they call her?
hi: इसको क्या कहते हैं?

source: What do they call it?
hi: इसको क्या कहते हैं?

source: What do they say for this?
hi: इसको क्या कहते हैं?

source: There was something lying on the ground.
hi: ज़मीन पर कुछ पड़ा था।

source: Nobody here eats meat.
hi: यहाँ कोई गोश्त नहीं खाता है।

source: I need new glasses.
hi: मुझे नया चश्मा चाहिए।

source: You drove.
hi: आपने चलाया!

source: This boy is his son.
hi: यह लड़का उसका बेटा है।

source: We will steal you from yourself.
hi: तुम्ही से तुम्ही को चुरा लेंगे हम।

source: Like us on Facebook!
hi: फ़ेसबुक पर हमें लाइक करें!

source: In the evening, we drank sugarcane juice.
hi: शाम को हमने गन्ने का रस पिया।

source: The next day, I bought a jackfruit.
hi: अगले दिन मैंने एक कटहल खरीद लिया।

source: Here stood a green field; now it is a supermarket.
hi: यहां एक हरा मैदान था; अब एक सुपरमार्केट है।

source: I didn't know you were so rich.
hi: मुझे नहीं पता था कि आप इतने अमीर हैं।

source: Closing your eyes helps you think better.
hi: आँखों को झुकाएं, ख़यालात को बुलंद करें...

source: There are four rooms in my house.
hi: मेरे घर में चार कमरे हैं।

source: We'll make it.
hi: हम बनाएंगे।

source: I want to see a Japanese movie.
hi: मुझे एक जापानी फ़िल्म देखनी है।

source: Tom is black.
hi: टॉम काला है।

source: I'm distressed by the daily squabbles.
hi: मैं रोज़ रोज़ के झगड़ों से तंग आ गया हूँ।

source: Come on, show that you can do something.
hi: चलिए, कुछ करके दिखाइए।

source: How?
hi: कैसे?

source: It's their dog.
hi: कुत्ता उनका है।

source: I rest on Sunday.
hi: रविवार को मैं आराम करता हूँ।

source: Again!
hi: फिर से!

source: How do you say "thanks" in French?
hi: फ़्रांसीसी में "धन्यवाद" कैसे कहते हैं?

source: Tom is teaching me French.
hi: टॉम मुझे फ़्रांसीसी सिखा रहा है।

source: I gave a lot of cheese.
hi: मैंने बहुत सारा चीज़ दिया।

source: How is Rob?
hi: रॉब कैसा है?

source: I ate a gulab jamun.
hi: मैंने एक गुलाब जामुन खाया।

source: I don't think it's reasonable.
hi: मेरे विचार से यह युक्तियुक्त नहीँ है।

source: I don't watch much basketball.
hi: मैं ज्यादा बास्‍केटबॉल नहीं देखता।

source: We've got that figured out.
hi: हमने उसका हिसाब लगा लिया।

source: Don't make me slap you.
hi: मुझे तुम्हें थप्पड़ करने के लिए मजबूर मत करो।

source: He translated the novel into German.
hi: उसने उपन्यास को जर्मन में भाषान्तर किया।

source: Where's the beach?
hi: समुद्र तट कहां है?

source: George Washington was the first president of the Unites States of America.
hi: जार्ज वाशिंगटन संयुक्त राज्य अमेरिका के पहले राष्ट्रपति थे

source: Is he alright?
hi: वह ठीक है क्या?

source: Salt is used to thaw ice.
hi: नमक का इस्तेमाल बर्फ़ पिघालने में किया जाता है।

source: I hope that you are proud of me.
hi: मुझे आशा है कि आप को मुझ पर गर्व है।

source: I've got a good understanding of Islam, but I know little about the Hindu religion and its culture.
hi: मुझे इस्लाम के विषय में अच्छी जानकारी है मगर हिंदू धरम एवं संस्कृति के बारे में कम ज्ञान है।

source: I pray that he makes it home safe.
hi: मैं प्रार्थना करता हूँ कि वह अपने घर को सलामती से पहुँचे।

source: Hindi and Urdu are one language.
hi: हिंदी और उर्दू एक ही भाषा हैं।

source: Everyone likes a peacock dance.
hi: नाच मोर सबको भाता.

source: Who wouldn't become enamored now?
hi: कौन न अब होगा फ़िदा?

source: We can compare our country to China.
hi: हम अपने देश की चीन से तुलना कर सकते हैं।

source: Water is very important.
hi: पानी बहुत जरूरी है।

source: Many people around the world don't have access to good quality water.
hi: दुनिया भर में बहुत से लोगों को अच्छा पानी उपलब्ध नहीं है।

source: That's a pretty good question.
hi: यह काफ़ी अच्छा सवाल है।

source: Whose letter is in this envelope?
hi: इस लिफाफे में किस की चिट्ठी है?

source: Put your letter in this envelope.
hi: आपका ख़त इस लिफाफे में डालें।

source: I'd caught him red-handed.
hi: मैंने उसे रंगे हाथों पकड़ा था।

source: I will tell you right now,.
hi: मैं अभी आपको बताता हूँ।

source: Let me tell you one thing.
hi: मुझे आपको एक बात बताने दें।

source: The atmosphere there is not very good.
hi: वहाँ माहौल बहुत अच्छा नहीं हो रहा है।

source: And time keeps passing on by.
hi: और वक़्त बीतता रहता है।

source: I can't support him through this.
hi: मैं इसके द्वारा उसकी बाँह नहीं पकड़ सकता हूँ।

source: A bad tradesman blames his tools.
hi: नाच न जाने, आँगन टेढ़ा।

source: Can you please do my hair?
hi: क्या आप मेरे बाल बनाएँ?

source: I'll certainly come tomorrow.
hi: मैं कल ज़रूर आऊँगा।

source: Leaders serve society.
hi: नेता लोग समाज की सेवा करते हैं।

source: What are your thoughts on the situation?
hi: उस स्थिति के बारे में आपका क्या ख्याल है?

source: Where's the library?
hi: पुस्तकालय कहाँ है?

source: My wardrobe has four doors and two mirrors. It was manufactured by a Swedish company, whose name contains three vowels and a consonant.
hi: मेरी अलमारी में चार पट और दो आईनें हैं. उसको एक स्वीडिश कंपनी ने बनाया है, जिसके नाम में तीन स्वर और एक व्यंजन है.

source: I helped Tom move the furniture.
hi: मैंने टॉम को फ़र्नीचर हटाने में मदद की।

source: Do you see a black horse?
hi: क्या आप काले घोड़े को देखते हो?

source: She was lovely.
hi: वह बहुत सुंदर थी।

source: Do you have cash worth more than ten thousand euros?
hi: क्या आप के पास दस हजार यूरो से ज्यादा की नकद है?

source: Try to do it like that.
hi: वैसे करने की कोशिश कीजिये।

source: Do you have a mop and a bucket?
hi: क्या आप के पास झाड़ू और बाल्टी है?

source: Both ants and termites live in large colonies.
hi: चीटियां और दीमक दोनों एक साथ बड़े कालोनी में रहते है।

source: We use public transport.
hi: हम सार्वजनिक यातायात का प्रयोग करते है।

source: He fell for the seventy-fourth time, dead tired.
hi: वो चौहत्तर बार असफल हो चुका है, अत्त्याधिक थका हुआ है।

source: This is a song.
hi: यह गाना है।

source: That is a song.
hi: वह गाना है।

source: I don't feel like walking that far.
hi: मुझे इतना दूर चलने का मन नहीं है।

source: Tom and Mary become friends right away.
hi: तॉम और मैरी तुरंत दोस्त बन गए।

source: Do you want me to open the windows?
hi: क्या आप चाहते हैं कि मैं खिड़कियाँ खोलूँ?

source: You've already done the hard part.
hi: तुमने मुशकिल हिस्स तो कर लिया है।

source: You always ask too many questions.
hi: तुम हमेशा ज़्यादा सवाल पूछते हो।

source: I think he is strange.
hi: वह मुझे अजीब लगता है।

source: Mom, please listen to me.
hi: माँ, मेरी बात सुनिए।

source: Their explanation was confusing.
hi: उनकी व्याख्या भ्रामक थी।

source: I asked him to take some pictures.
hi: मैंने उससे कुछ तस्वीरें लेने पूछा।

source: Everyone lies.
hi: सारे लोग झूठ बोलते हैं।

source: You don't know how to do anything.
hi: तुमको कुछ नहीं आता।

source: If you did not want to do this, then why did you do it? Did someone force you to do this?
hi: तुम्हें यह नहीं करना था तो क्यूँ किया? क्या किसी ने तुम पर इसके लिये ज़बरदस्ती की?

source: Tom never tells us anything.
hi: टॉम हमें कभी कुछ नहीं बताता है.

source: I don't pay attention to gossip.
hi: मैं गपशप पर ध्यान नहीं रखता हूँ.

source: Only Tom knows the truth.
hi: सिर्फ़ टॉम को सच पता है.

source: I want to get off here.
hi: मैं यहाँ उतरना चाहता हूँ.

source: I can't speak.
hi: मैं बोल नहीं पा रहा हूँ.

source: Tom has an MBA.
hi: टॉम के पास MBA है.

source: Tom has a squirrel.
hi: टॉम के पास एक गिलहरी है.

source: Tom and Mary often worry about money.
hi: टॉम और मैरी अक्सर पैसे के बारे चिंता करते हैं.

source: Nehi is a woman.
hi: नेहा एक औरत है।

source: That is a book.
hi: वह एक किताब है।

source: Raj is a man.
hi: राज एक आदमी है।

source: Peter reads a book.
hi: पीटर किताब पढ़ता है।

source: Amazing!
hi: क्या बात है!

source: What's your good name?
hi: आपका शुभ नाम क्या है?

source: He's at school.
hi: वह स्कूल में है।

source: She's at school.
hi: वह स्कूल में है।

source: It's at school.
hi: वह स्कूल में है।

source: She's inside the school.
hi: वह स्कूल में है।

source: He disdained bribery.
hi: उसे घूसखोरी से नफ़रत थी।

source: Capri is one of the most beautiful islands in Italy.
hi: कापरी इटली में सबसे सुंदर द्वीपों में से एक है।

source: He got 90 on his English test.
hi: उसे अंग्रेज़ी में नब्बे अंक मिले।

source: The monkeys jump from branch to branch.
hi: बन्दर एक डाली से दूसरी डाली पर कूदते हैं।

source: It isn't easy, but it's doable.
hi: यह आसान नहीं है लेकिन करा जा सकता है।

source: Do you jog every day?
hi: क्या आप हर दिन जॉगिंग करते हैं?

source: Tom doesn't yet know how to do that.
hi: टॉम अभी तक नहीं जानता कि ऐसा कैसे करना है।

source: Tom doesn't know how to do that yet.
hi: टॉम अभी तक नहीं जानता कि यह कैसे करना है।

source: But don't get me wrong.
hi: लेकिन मुझे गलत मत समझिए।

source: I actually have to do that.
hi: मुझे वास्तव में ऐसा करना है।

source: Losing your friendship saddened me deeply.
hi: मुझे ग्रिल्ड मशरूम बहुत पसंद हैं।

source: It's terribly hot in here.
hi: यहाँ बहुत गर्म है।

source: My partner grills the best mushrooms.
hi: मेरा साथी सबसे अच्छे मशरूम बनाता है।

source: Tom wants to leave the house.
hi: टॉम घर छोड़ना चाहता है।

source: Did you give the money back to your mother?
hi: क्या तुमने अपनी माँ को पैसे लौटा दिए?

source: Our team isn't very good.
hi: हमारी टीम बहुत अच्छी नहीं है।

source: Why have you shut the door?
hi: तुम ने दरवाज़ा क्यों बंद कर दिया ?

source: It's really hot outside.
hi: बाहर बहुत गर्मी है।

source: I'm afraid that Tom might come.
hi: मुझे डर है की टॉम आ जाएगा।

source: Tom has graduated from college.
hi: टॉम ने कॉलेज से स्नातक कर लिया है।

source: Tom wants to go somewhere else.
hi: टॉम कहीं और जाना चाहता है।

source: Don't get involved in our fight!
hi: हमारी लड़ाई में शामिल न हों!

source: It's windy, isn't it?
hi: यहाँ हवा चल रही है, है ना?

source: I've read this book three times.
hi: मैंने इस पुस्तक को तीन बार पढ़ा है।

source: It was clear that Tom was lying.
hi: यह स्पष्ट था कि टॉम झूठ बोल रहा था।

source: It was really boring.
hi: यह बहुत उबाऊ था।

source: Is Tom going to the supermarket?
hi: क्या टॉम बड़े बाज़ार में जा रहा है?

source: You shouldn't be outside.
hi: आपको बाहर नहीं होना चाहिए।

source: I had a little fever.
hi: मुझे थोड़ा बुखार था।

source: Tom is strict with his children.
hi: टॉम अपने बच्चों के साथ सख्ती से पेश आता है।

source: That was an exemplary performance!
hi: वह एक अनुकरणीय प्रदर्शन था!

source: We have a black dog.
hi: हमारे पास काला कुत्ता है।

source: Tom wants to do that alone.
hi: टॉम अकेले वैसा करना चाहता है।

source: Sounds great.
hi: बढ़िया

source: I go there once a month.
hi: मैं वहाँ महीने में एक बार जाती हूँ।

source: Will you please stick a 60-cent stamp on the envelope?
hi: क्या आप कृपया चिट्ठी पे एक साठ पैसे का डाक टिकिट लगवा देंगे?

source: Our wallets were stolen.
hi: हमारे बटुआ को चुराया गया।

source: Tom earns a lot more than me.
hi: टॉम मुझसे ज़्यादा कमाता है।

source: Everyone's tired of you.
hi: सभी तुमसे थक गए हैं।

source: What kind of games does Tom like?
hi: टॉम को किस तरह के खेल पसंद हैं?

source: Tom offered Mary a hot meal.
hi: टॉम ने मैरी को गरम भोजन परोसा।

source: Did you know my parents before they got married?
hi: शादी से पहले, क्या तुम मेरे अभिभावकों को जानते थे?

source: There's nobody in the pool.
hi: तरणताल में कोई नहीं है।

source: I know what Tom is going to say.
hi: मुझे पता है कि टॉम क्या कहेगा।

source: It's not easy to love someone like Tom.
hi: टॉम जैसे किसी व्यक्ति से प्यार करना आसान नहीं है।

source: Do you think that Tom told the truth?
hi: तुम्हारे विचार में क्या टॉम ने सच कहा?

source: Don't you dare say that again.
hi: दुबारा कहने की हिम्मत भी न करना।

source: You're not like Tom at all.
hi: तुम एक दम टॉम के जैसे नहीं हो।

source: We're not very good singers.
hi: हम बहुत एक गायक नहीं हैं।

source: We're not good singers.
hi: हम अच्छे गायक नहीं हैं।

source: Tom won't do that unless you ask him.
hi: जब तक तुम टॉम को नहीं पूछोगे, तब तक वह उसे नहीं करेगा।

source: Tom won't do that even if you ask him.
hi: यदि तुम उसे पूछो तो भी टॉम उसे नहीं करेगा।

source: I think Tom won't do it again.
hi: मुझे लगता है कि टॉम उसे फिर से नहीं करेगा।

source: Tom's first wife was much older than him.
hi: टॉम की पहली पत्नी का उमर उसके उम्र से ज़्यादा था।

source: Tom remarried after his first wife died.
hi: उसके प्रथम पत्नी के मौत के बाद, टॉम ने फिर से शादी की।

source: I knew that something horrible was about to happen.
hi: मुझे पता था कि कुछ बुरा होने वाला था।

source: Tom's house is falling apart.
hi: टॉम का घर टूट पड़ रहा है।

source: Tom will stay with us for now.
hi: टॉम अब हमारे साथ रहेगा।

source: How fast can you read?
hi: तुम कितने जल्दी पढ़ सकता हो?

source: Tell Tom what Mary was wearing.
hi: टॉम को बताओ की मेरी क्या पहनी हुई थी।

source: Tom fell in love with a girl he met in Boston.
hi: टॉम को एक लड़की से प्यार हो गया जिसे वह बॉस्टन में मिला था।

source: "I don't like this song." "I don't, either."
hi: “मुझे यह गाना पसंद नहीं है।” “मुझे भी नहीं।”

source: Tom won't do that even if you ask him to.
hi: यदि तुम उसे पूछो तो भी टॉम उसे नहीं करेगा।

source: Everybody's tired of you.
hi: सभी तुमसे थक गए हैं।

source: A thief doesn't believe in honest people.
hi: एक चोर ईमानदार लोगों में विश्वास नहीं करता है।

source: What does obtaining freedom really mean? It may seem like cleverly escaping out of a cage, but one just ends up in another bigger cage.
hi: आज़ादी पाने का सत्यार्थ क्या है? ऐसा लग सकता है कि कोई चालाकी से एक पिंजरे से निकला है, पर वह किसी दूसरे बड़े पिंजरे में अटक जाता है।

source: I will not be at home tomorrow.
hi: मैं कल घर पर नहीं रहूँगा।

source: Sita's mother can make good fritters.
hi: सीता की माँ अच्छे पकोड़े बना सकतीं हैं।

source: If it isn't a bad, dirty, or wrong thing, then it's alright.
hi: यदि वह बुरा, गंदा या गलत न हो तो ठीक है।

source: He ran here to tell me this.
hi: वह मुझे यह बताने के लिए यहाँ दौड़कर आया।

source: Let Grandma take care of the kid.
hi: नानीजी को बच्चे का ख्याल रखने दो।

source: French is a required subject.
hi: फ़्रेंच एक अनिवार्य विषय है।

source: They weren't from Boston.
hi: वे बॉस्टन से नहीं थे।

source: Whenever she wears high heels, her legs hurt.
hi: जब भी वो लम्बी हील्स पहनती है, उसकी टांगें हमेशा दर्द करती है।

source: I want to buy the dress.
hi: मैं वह ड्रेस खरीदना चाहता हूँ।

source: The door of the office is yellow.
hi: दफ़्तर का दरवाज़ा पीला है।

source: I am in the kitchen.
hi: मैं रसोई में हूँ।

source: I live in Russia. What about you? I live in Ukraine.
hi: "मैं रूस में रहता हूं। और तुम?" "मैं यूक्रेन में।"

source: She fell into the river.
hi: वह नदी में गिर गयी।

source: Our club is open all night.
hi: हमारा क्लब पूरी रात खुला है।

source: He began to find life dry.
hi: उसको जीवन शुष्क लगने लगा है।

source: I don't distrust you.
hi: मैं तुमसे बदगुमानी नहीं करता।

source: The oppression of women is a social issue.
hi: औरतों पर अत्याचार एक सामाजिक समस्या है।

source: The father told his son that his studies had been completed then so he should go outside and work instead of getting food at home for free.
hi: पिता ने अपने बेटे से कहा कि अब तुम्हारी पढ़ाई पूरी हो गई है। बाहर जाकर नौकरी करो, घर में मुफ्त की रोटियां मत तोड़ो।

source: What will I get in return for your friend's bail?
hi: तुम्हारे दोस्त की रिहाई के बदले में हमे क्या मिलेगा?

source: Don't cause a commotion.
hi: हल्ला मत मचाओ।

source: Don't cross the road.
hi: सड़क पार मत करो।

source: Thank you for your interest in our language.
hi: हमारी भाषा में रूचि रखने के लिए धन्यवाद्।

source: He didn't find work.
hi: उसे काम नहीं मिला।

source: Don't meddle in things that are none of your business.
hi: तुम दूसरों के मसलों में अपनी नाक मत घुसाओ।

source: I had some really weird dreams tonight.
hi: आज रात मुझे बड़े अजीब सपने आये।

source: Don't worry. I'll tell him.
hi: चिंता मत करो। मैं उसे बता दूंगा।

source: If you aren't going, I'm not going either.
hi: अगर तुम नहीं जाओगे, तो फ़िर मै भी नहीं जाउंगी।

source: Yanni wants to sell his car.
hi: यान्नी को अपनी गाड़ी बेचनी है।

source: Yanni was Muslim.
hi: यान्नी मुस्लिम था।

source: Yanni saw the mountain.
hi: यान्नी को पर्वत दिखा।

source: A clean and deserted road can be found at some distance ahead.
hi: कुछ ही आगे एक साफ़ और वीरान सड़क मिलेगी।

source: What is your relation to him?
hi: तुम्हारा उससे क्या ताल्लुक़ है?

source: Let's fuck.
hi: चोदते हैं।

source: Tom is somewhere nearby.
hi: टॉम आसपास ही कहीं है।

source: You can't eat peace.
hi: शांति से पेट नहीं भरता।

source: Yanni told his dad.
hi: यान्नी ने अपने पापा को बताया।

source: Skura looks just like Janet Jackson.
hi: स्कुरा बिलकुल जैनेट जैक्सन जैसी दिखती है।

source: I didn't know that then.
hi: वह मुझे तब पता नहीं था।

source: What Russian words do you know?
hi: तुम्हें कौनसे रूसी शब्द पता हैं?

source: Tom didn't tell us his surname.
hi: टॉम ने हमें अपना उपनाम बताया नहीं।

source: Where are you all?
hi: आप सब कहाँ थे?

source: You're a student.
hi: तुम विद्यार्थी हो।

source: That flower is white.
hi: वह फूल सफ़ेद है।

source: That is a flower.
hi: वह एक फूल है।

source: His hair is wet.
hi: उसके बाल गीले हैं।

source: She believes in God.
hi: वह भगवान को मानती है।

source: That's a flower.
hi: वह एक फूल है।

source: Tom makes fun of everyone.
hi: टॉम सबका मज़ाक़ उड़ाता है।

source: I cannot lend this book to you.
hi: यह किताब में तुम्हे उधार में नहीं दे सकता।

source: The door of languages unlocked.
hi: भाषाओं के दरवाज़े का ताला खुल गया।

source: Legendary actor Amitabh Bachchan has been honoured with the Dadasaheb Phalke Award by the Government.
hi: सिनेमा जगत के महान अभिनेता अमिताभ बच्चन को भारत सरकार ने दादा साहब फाल्के अवार्ड से सम्मानित किया है।

source: Valentine's Day is being celebrated all over the world, where everyone is expressing love to their partner.
hi: पूरे विश्व भर में वेलेंटाइन डे मनाया जा रहा है, जहाँ पर सभी लोग अपने पार्टनर के साथ प्यार का इजहार कर रहे हैं ।

source: Former Indian opener Virender Sehwag is known as one of the most destructive openers in Indian cricket history.
hi: पूर्व भारतीय ओपनर वीरेंद्र सहवाग को भारतीय क्रिेकेट इतिहास के सबसे विध्वसंक ओपनरों में जाना जाता है।

source: There is much opposition to this decision of the Government of India.
hi: भारत सरकार के इस फैसले का बहुत ज़्यादा विरोध हो रहा है।

source: The legendary South African fast bowler Dale Steyn had recently announced his retirement from Test cricket.
hi: साउथ अफ्रीका के दिग्गज तेज गेंदबाज डेल स्टेन ने टेस्ट क्रिकेट से संन्यास की घोषणा कर दी थी।

source: Iran has declared all US forces as terrorists in the case of the assassination of General Qasim Suleimani.
hi: जनरल कासिम सुलेमानी की हत्या के मामले में ईरान ने सभी अमेरिकी बलों को आतंकवादी घोषित कर दिया है।

source: With this, the police has started investigating the case.
hi: इसके साथ ही पुलिस मामले की जांच में जुट गई है।

source: The impact of the challenging environment in the economy has greatly impacted the already troubled textile sector.
hi: इकॉनमी में चुनौतीपूर्ण माहौल का असर पहले से परेशानी में चल रहे टेक्सटाइल सेक्टर पर बहुत ही ज़्यादा हुआ है।
